{
    "format": "layers-model",
    "generatedBy": "keras v3.10.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "BehaviorGuardAI_Simple",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                100
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "behavioral_features"
                        },
                        "name": "behavioral_features",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_128",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_128",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                100
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "behavioral_features",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_128",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout_128",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "dense_128",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "training": false
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_64",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_64",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "dropout_128",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_64",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.2,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout_64",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "dense_64",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "training": false
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "fraud_probability",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "fraud_probability",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "dropout_64",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "behavioral_features",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "fraud_probability",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy",
                "precision",
                "recall"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.0010000000474974513,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_128/kernel",
                    "shape": [
                        100,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_128/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_64/kernel",
                    "shape": [
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_64/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fraud_probability/kernel",
                    "shape": [
                        64,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fraud_probability/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}