{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 1, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_2"}, "name": "input_layer_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 100], "dtype": "float32", "keras_history": ["input_layer_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 256], "dtype": "float32", "keras_history": ["dense_8", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 256], "dtype": "float32", "keras_history": ["batch_normalization_3", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "lstm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 256], "dtype": "float32", "keras_history": ["dropout_6", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["lstm", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["batch_normalization_4", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dropout_7", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_9", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["batch_normalization_5", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dropout_8", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_10", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["batch_normalization_6", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dropout_9", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_2", 0, 0]], "output_layers": [["dense_11", 0, 0]]}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"name": "binary_crossentropy", "reduction": "sum_over_batch_size", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "loss_weights": null, "metrics": ["accuracy", {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9713336825370789, "scale": 1.3136187034112743e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_3/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.044812222503729925, "scale": 1.3854879576963246e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 4.9457299610367045e-05, "scale": 1.5073486916069237e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.10959114134311676, "scale": 1.0419796413020866e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9699468016624451, "scale": 8.966235717228605e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.04902280658503969, "scale": 1.4266575456911616e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.02932352901313392, "scale": 9.051030623227952e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.12681803107261658, "scale": 2.564439022669287e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_5/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9626274704933167, "scale": 1.4921224953117437e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_5/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.057593897211749026, "scale": 1.5843391618548918e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.35440629720687866, "scale": 3.5083720474318835e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.42261427640914917, "scale": 1.9550335309939663e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9496259093284607, "scale": 1.8843244231155593e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.23407503265242033, "scale": 6.603335382882541e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.4415540099143982, "scale": 4.615040259093144e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.5317055583000183, "scale": 3.266437581013494e-05, "original_dtype": "float32"}}, {"name": "dense_10/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.20557580490656918, "scale": 6.667179247148251e-06, "original_dtype": "float32"}}, {"name": "dense_10/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.05493726702004119, "scale": 1.411144512600272e-06, "original_dtype": "float32"}}, {"name": "dense_11/kernel", "shape": [64, 1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2608425138107088, "scale": 8.963044251622183e-06, "original_dtype": "float32"}}, {"name": "dense_11/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.15396547317504883, "scale": 1.0, "original_dtype": "float32"}}, {"name": "dense_8/kernel", "shape": [100, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.16585102466225596, "scale": 5.684306976805565e-06, "original_dtype": "float32"}}, {"name": "dense_8/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.025325426558846783, "scale": 7.218100256183886e-07, "original_dtype": "float32"}}, {"name": "dense_9/kernel", "shape": [128, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.18431300275829826, "scale": 5.486812418382301e-06, "original_dtype": "float32"}}, {"name": "dense_9/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.052941455437788346, "scale": 1.3707590346897712e-06, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/kernel", "shape": [256, 512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.11956143891492134, "scale": 3.890454214334288e-06, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2213422436583476, "scale": 6.090032842436307e-06, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.044132738377229024, "scale": 1.593239652607546e-05, "original_dtype": "float32"}}]}]}